In [1]:

import pandas as pd
import matplotlib.pyplot as plt

In [2]:
from sqlalchemy import create_engine, text

In [3]:
database_name = 'scooters'    # Fill this in with your lahman database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
connection_string

'postgresql://postgres:postgres@localhost:5432/scooters'

In [5]:
engine = create_engine(connection_string)

In [6]:
query = '''
SELECT DISTINCT sumdgroup
FROM scooters
'''

with engine.connect() as connection:    
    scooter= pd.read_sql(text(query), con = connection)

In [7]:
scooter

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [8]:
unique_sumdgroup_values=scooter['sumdgroup'].unique()
unique_sumdgroup_values

array(['bicycle', 'scooter', 'Scooter'], dtype=object)

- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [9]:
query = '''
SELECT MIN(latitude),MIN(longitude)
FROM scooters
'''

with engine.connect() as connection:    
    min_lat_lon= pd.read_sql(text(query), con = connection)

In [10]:
min_lat_lon

   min        min
0  0.0 -97.443879

In [11]:
query = '''
SELECT MAX(latitude),MAX(longitude)
FROM scooters
'''

with engine.connect() as connection:    
    max_lat_lon= pd.read_sql(text(query), con = connection)

In [12]:
max_lat_lon

            max  max
0  3.609874e+06  0.0

In [13]:
query = '''
SELECT DISTINCT companyname
FROM trips;
'''

with engine.connect() as connection:    
    trips_company= pd.read_sql(text(query), con = connection)

In [14]:
trips_company

     companyname
0           Bird
1  Bolt Mobility
2         Gotcha
3           JUMP
4           Lime
5           Lyft
6           SPIN

-What is the range of values for trip duration and trip distance?

In [15]:
query = '''
SELECT min(tripduration)as min_duration,min(tripdistance)as min_dis
FROM trips;
'''

with engine.connect() as connection:    
    min_dur_dis= pd.read_sql(text(query), con = connection)

In [16]:
min_dur_dis

   min_duration     min_dis
0    -19.358267 -20324803.8

In [17]:
query = '''
SELECT max(tripduration)as max_duration,max(tripdistance)as max_dis
FROM trips;
'''

with engine.connect() as connection:    
    max_dur_dis= pd.read_sql(text(query), con = connection)

In [18]:
max_dur_dis

   max_duration       max_dis
0      512619.0  3.188448e+07

In [19]:
query = '''
SELECT *
FROM scooters
LIMIT 100;
'''

with engine.connect() as connection:    
    scooters= pd.read_sql(text(query), con = connection)

In [20]:
scooters

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird
...,...,...,...,...,...,...,...,...,...
95,2019-05-01 00:01:41.247,36.141158,-86.801997,PoweredWDMWW,Powered,69.0,scooter,0.0,Bird
96,2019-05-01 00:01:41.247,36.138786,-86.801667,PoweredSNB79,Powered,88.0,scooter,0.0,Bird
97,2019-05-01 00:01:41.247,36.162634,-86.781603,PoweredM69E2,Powered,91.0,scooter,0.0,Bird
98,2019-05-01 00:01:41.247,36.144795,-86.795576,PoweredHY38F,Powered,88.0,scooter,0.0,Bird
99,2019-05-01 00:01:41.247,36.165809,-86.777780,Powered2WLYW,Powered,98.0,scooter,0.0,Bird

In [21]:
query = '''
SELECT *
FROM trips
LIMIT 100;
'''

with engine.connect() as connection:    
    trips= pd.read_sql(text(query), con = connection)

In [22]:
trips

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.000000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.715600,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.000000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.000000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.000000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2019-05-01 00:35:56.717,Bird,BRD2303,Powered8KKHS,19.000000,5577.42800,2019-05-01,00:17:51.036666,2019-05-01,00:37:14.486666,36.15120,-86.79670,36.15230,-86.79740,"[(36.151314, -86.796638), (36.151649, -86.7969...",2019-05-02 05:30:28.553
96,2019-05-01 00:35:56.717,Bird,BRD2299,PoweredGMUYI,11.000000,2952.75600,2019-05-01,00:26:24.846666,2019-05-01,00:36:56.396666,36.15130,-86.79700,36.15600,-86.78860,"[(36.1513, -86.796749), (36.151232, -86.796398...",2019-05-02 05:30:28.427
97,2019-05-01 00:35:56.717,Bird,BRD2302,PoweredISXDY,17.000000,8202.10000,2019-05-01,00:18:55.406666,2019-05-01,00:36:04.586666,36.16730,-86.78300,36.15440,-86.79890,"[(36.166937, -86.782786), (36.165893, -86.7818...",2019-05-02 05:30:28.523
98,2019-05-01 00:37:02.933,Lyft,LFT59,Powered980721,15.817283,11404.19984,2019-05-01,00:21:13.733333,2019-05-01,00:37:02.770000,36.15840,-86.77693,36.16908,-86.76753,"[(36.1584, -86.77693), (36.15845, -86.7769), (...",2019-05-02 07:20:34.490
99,2019-05-02 22:58:02.153,Bird,BRD2496,PoweredM3I1J,8.000000,328.08400,2019-05-02,22:51:00.006666,2019-05-02,22:58:43.726666,36.14020,-86.80610,36.14030,-86.80630,"[(36.140322, -86.806245)]",2019-05-03 05:31:29.677

Are there any null values in any columns in either table?

In [23]:
scooter.isnull()

   sumdgroup
0      False
1      False
2      False

In [24]:
trips.isnull()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

What date range is represented in each of the date columns? Investigate any values that seem odd

In [25]:
trips.columns

Index(['pubtimestamp', 'companyname', 'triprecordnum', 'sumdid',
       'tripduration', 'tripdistance', 'startdate', 'starttime', 'enddate',
       'endtime', 'startlatitude', 'startlongitude', 'endlatitude',
       'endlongitude', 'triproute', 'create_dt'],
      dtype='object')

In [26]:
start_date=trips['startdate'].min()
start_date

datetime.date(2019, 5, 1)

In [27]:
end_date=trips['enddate'].max()
end_date

datetime.date(2019, 5, 2)

- Is time represented with am/pm or using 24 hour values in each of the columns that include time?

In [28]:
trips['starttime'].head()

0    00:00:20.460000
1    00:01:50.090000
2    00:03:47.363333
3    00:04:21.386666
4    00:04:27.796666
Name: starttime, dtype: object

In [29]:
trips['endtime'].head()

0    00:02:52.346666
1    00:03:33.026666
2    00:07:13.596666
3    00:06:59.176666
4    00:06:23.150000
Name: endtime, dtype: object

it is a 24 hour value

In [30]:
scooter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   sumdgroup  3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [31]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   pubtimestamp    100 non-null    datetime64[ns]
 1   companyname     100 non-null    object
 2   triprecordnum   100 non-null    object
 3   sumdid          100 non-null    object
 4   tripduration    100 non-null    float64
 5   tripdistance    100 non-null    float64
 6   startdate       100 non-null    object
 7   starttime       100 non-null    object
 8   enddate         100 non-null    object
 9   endtime         100 non-null    object
 10  startlatitude   100 non-null    float64
 11  startlongitude  100 non-null    float64
 12  endlatitude     100 non-null    float64
 13  endlongitude    100 non-null    float64
 14  triproute       100 non-null    object
 15  create_dt       100 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(6), object(8)
memory usage: 12.6+ KB

In [32]:
scooter.isna().sum()

sumdgroup    0
dtype: int64

In [33]:
trips.isna().sum()

pubtimestamp      0
companyname       0
triprecordnum     0
sumdid            0
tripduration      0
tripdistance      0
startdate         0
starttime         0
enddate           0
endtime           0
startlatitude     0
startlongitude    0
endlatitude       0
endlongitude      0
triproute         0
create_dt         0
dtype: int64

- What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [34]:
scooter['sumdgroup'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: sumdgroup
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?